Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 35)                0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 35, 300)           19399200  
_________________________________________________________________
bidirectional_2 (Bidirection (None, 300)               1081800   
_________________________________________________________________
dense_1 (Dense)              (None, 35)                10535     
=================================================================
Total params: 20,491,535
Trainable params: 1,092,335
Non-trainable params: 19,399,200
_________________________________________________________________
Training Accuracy:  0.9957
Validation Accuracy:  0.7429
Testing Accuracy:  0.7114
