Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 35)                0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 35, 300)           19399200  
_________________________________________________________________
gru_1 (GRU)                  (None, 300)               540900    
_________________________________________________________________
dense_1 (Dense)              (None, 35)                10535     
=================================================================
Total params: 19,950,635
Trainable params: 551,435
Non-trainable params: 19,399,200
_________________________________________________________________
Training Accuracy:  0.9895
Validation Accuracy:  0.7429
Testing Accuracy:  0.7129
