Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 35)                0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 35, 300)           19399200  
_________________________________________________________________
lstm_1 (LSTM)                (None, 300)               721200    
_________________________________________________________________
dense_1 (Dense)              (None, 35)                10535     
=================================================================
Total params: 20,130,935
Trainable params: 731,735
Non-trainable params: 19,399,200
_________________________________________________________________
Training Accuracy:  0.9832
Validation Accuracy:  0.7143
Testing Accuracy:  0.7014
