Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 35)                0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 35, 300)           19399200  
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 33, 300)           270300    
_________________________________________________________________
global_max_pooling1d_1 (Glob (None, 300)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 35)                10535     
=================================================================
Total params: 19,680,035
Trainable params: 280,835
Non-trainable params: 19,399,200
_________________________________________________________________
Training Accuracy:  0.9993
Validation Accuracy:  0.7529
Testing Accuracy:  0.7200
