Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 35)                0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 35, 300)           19399200  
_________________________________________________________________
bidirectional_1 (Bidirection (None, 600)               1081800   
_________________________________________________________________
dense_2 (Dense)              (None, 300)               180300    
_________________________________________________________________
dense_1 (Dense)              (None, 35)                10535     
=================================================================
Total params: 20,671,835
Trainable params: 1,272,635
Non-trainable params: 19,399,200
_________________________________________________________________
Training Accuracy:  0.9975
Validation Accuracy:  0.7429
Testing Accuracy:  0.7014
